Revit 2027 API
BuiltInFailures.ConnectorFailures.JointGenderMismatch Property
 The element has a connector with a fitting joint gender mismatch
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId JointGenderMismatch { get; }
Public Shared ReadOnly Property JointGenderMismatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ JointGenderMismatch {
	FailureDefinitionId^ get ();
}
static member JointGenderMismatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace